package curriculum_B;

//コンソール入力用のクラスをインポート
import java.util.Scanner;

public class Qes6 {

	public static void main(String[] args) {
		
		/* 問6
		 * 入力した商品の残り台数が出力されるシステムを下記の条件で作成してください
		 * ・拡張for文・Switch文・条件演算子を使用すること　※普通のif文は使用不可
		 * ・Switch文内でテレビとディスプレイは続けて書くようにしてください、条件演算子で出力される値を変更してください
		 * ・テレビとディスプレイは同じ商品扱いとし、ディスプレイが出た場合は最大個数の11個からランダムで出た数字を引いて出力してください 
		 * ・例：テレビと受け取った場合、→「テレビの残り台数は〇〇台です」※〇〇はランダムで出た数字
		 * ・入力される値は右記の表のどれかが入力され、入力回数の縛りはありません
		 * ・入力された値は「、」区切りで指定してください
		 * ・そのほかの値が入力された場合下記を出力されるようにしてください
		 * 		『受け取った値』は指定の商品ではありません
		 * ・残り台数は0〜11までのランダムな値が出力されるようにしてください
		 */
		
		/******************************************************
		 * 0～11のランダムな値を各商品の残り台数に代入
		 ******************************************************/
		
		// テレビとディスプレイの初期台数を宣言
		int tvDisplayCOunt = 11;
		
		
		
		
				
		// メッセージを出力
		System.out.println("商品名を入力してください");
		// コンソール入力用のインスタンスを生成
		Scanner scanner = new Scanner(System.in);
		
		// ユーザー名にコンソールに入力した値を代入
		String input = scanner.nextLine();
		
		// 入力した文字列を"、"で分割
		String[] inputArr = input.split("、");
		
		

		
	}

}
